una1veritas/ARMWork/STM32Libraries/STM32F37x_I2C_CPAL_Driver/inc/stm32f37x_i2c_cpal.h
/**
  ******************************************************************************
  * @file    stm32f37x_i2c_cpal.h
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    20-September-2012
  * @brief   This file contains all the functions prototypes for the I2C firmware
  *          layer.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
/*========= CPAL library files includes =========*/
#include "stm32f37x_i2c_cpal_hal.h"
#include "stm32f37x_i2c_cpal_conf.h"

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F37X_I2C_CPAL_H
#define __STM32F37X_I2C_CPAL_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ------------------------------------------------------------*/
/*========= CPAL_Dev_TypeDef =========*/
/* CPAL devices enumeration contains the device instances */

typedef enum
{
  CPAL_I2C1       =   0x00,	    /*!< Use I2C1 device */

  CPAL_I2C2       =   0x01      /*!< Use I2C2 device */

}CPAL_DevTypeDef;


/*========= CPAL_Direction_TypeDef =========*/
/* CPAL transfer directions enumeration is used to configure DMA channels
   (TX and RX) if CPAL_PROGMODEL_DMA is selected or TX/RX interrupts
   if CPAL_PROGMODEL_INTERRUPT is selected:
       - If CPAL_DIRECTION_TX is selected only TX DMA Channel or TX Interrupt is configured
       - If CPAL_DIRECTION_RX is selected only RX DMA Channel or RX Interrupt is configured
       - If CPAL_DIRECTION_TXRX is selected both TX and Rx DMA Channels or Interrupts are configured.*/

typedef enum
{
  CPAL_DIRECTION_TX        = 0x01,         /*!<Transmitter only direction */

  CPAL_DIRECTION_RX        = 0x02,         /*!<Receiver only direction */

  CPAL_DIRECTION_TXRX      = 0x03          /*!<Transmitter and Receiver direction */

}CPAL_DirectionTypeDef;


/*========= CPAL_Mode_TypeDef =========*/
/* CPAL device Mode enumeration is used to select in which mode the
   device will proceed : in master mode or slave mode.
   When an I2C device is used in master mode, it will initiate communication
   by sending start bit. When it is used in slave mode, it will wait till
   receiving its own address to start communication.*/

typedef enum
{
  CPAL_MODE_MASTER   =   0x00,    /*!< Use device as master */

  CPAL_MODE_SLAVE    =   0x01     /*!< Use device as slave */

}CPAL_ModeTypeDef;


/*========= CPAL_ProgModel_TypeDef =========*/
/* CPAL Programming Models enumeration  is used to define the programming
   model of device communication.
          - CPAL_PROGMODEL_DMA : device is programmed to communicate using DMA.
          - CPAL_PROGMODEL_INTERRUPT : device is programmed to communicate using
            interruption ( TXE , RXNE ...) handlers.
          - CPAL_PROGMODEL_POLLING : device is programmed to communicate using
            application polling routines (interrupts and DMA will not be used).*/

typedef enum
{
  CPAL_PROGMODEL_INTERRUPT = 0x01,         /*!<Interrupt transfer programming model */

  CPAL_PROGMODEL_DMA       = 0x02          /*!<DMA transfer programming model */

}CPAL_ProgModelTypeDef;


/*========= CPAL_Transfer_TypeDef =========*/
/* CPAL Transfer structure contains all transfer parameters which are used
   in every Read or Write operation.*/

typedef struct
{
  uint8_t*        pbBuffer;        /*!<The address of the buffer from/to which the transfer should start */

  __IO uint32_t   wNumData;        /*!<Number of data to be transferred for the current transaction */

  uint32_t        wAddr1;          /*!<Contains the Target device Address (optional)*/

  uint32_t        wAddr2;          /*!<Contains the Register/Physical Address into the device (optional) */

} CPAL_TransferTypeDef;


/*========= CPAL_State_TypeDef =========*/
/* CPAL global State enumeration contains the current state of CPAL communication.
   Before starting each operation this state is tested. After each operation
   CPAL_State is updated with the new value resulting from the relative operation.*/

typedef enum
{
  CPAL_STATE_DISABLED = 0x00,        /*!<The Disabled state indicates that the device
                                         is not configured.*/

  CPAL_STATE_READY    = 0x01,        /*!<The Ready state indicates that the device is configured
                                         correctly and is ready for read or write operation and/or
                                         the last transaction has been successfully completed */

  CPAL_STATE_READY_TX = 0x03,        /*!<The Ready_TX state indicates that the device is ready for
                                         transmission operation */

  CPAL_STATE_READY_RX = 0x05,        /*!<The Ready_RX state indicates that the device is ready for
                                         reception operation */

  CPAL_STATE_BUSY     = 0x02,        /*!<The Busy state indicates that a Write or Read
                                         operation started */

  CPAL_STATE_BUSY_TX  = 0x06,        /*!<The Busy_TX state indicates that a transmission
                                         operation is on going */

  CPAL_STATE_BUSY_RX  = 0x0A,        /*!<The Busy_RX state indicates that a reception
                                         operation is on going */

  CPAL_STATE_ERROR    = 0x10,        /*!<The Error state indicates that the last operation failed.
                                         To determine which error caused the failure, read the
                                         device status structure.*/
}CPAL_StateTypeDef;

/*========= CPAL_I2CError_TypeDef =========*/ 
/* I2C Errors TypeDef */

